#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web/runs/run-dmvmRsxKdQevu6MG

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E5VWR9I7KGZSJ]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=1920302536]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E3PO6D275Y4WSU]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js"]: Refreshing state... [id=static/js/726.e869980a.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css.map"]: Refreshing state... [id=static/css/main.af03688d.css.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js.map"]: Refreshing state... [id=static/js/726.e869980a.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js"]: Refreshing state... [id=static/js/106.74767f96.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js.map"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js"]: Refreshing state... [id=static/js/915.2b20329f.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.312fb1e8.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.312fb1e8.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.312fb1e8.js.map"]: Refreshing state... [id=static/js/main.312fb1e8.js.map]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.map"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css"]: Refreshing state... [id=static/css/main.af03688d.css]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js.map"]: Refreshing state... [id=static/js/106.74767f96.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.312fb1e8.js"]: Refreshing state... [id=static/js/main.312fb1e8.js]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css.map"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js"]: Refreshing state... [id=static/js/777.3fc69ada.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js.map"]: Refreshing state... [id=static/js/777.3fc69ada.chunk.js.map]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js.map]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js.map"]: Refreshing state... [id=static/js/915.2b20329f.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.312fb1e8.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.312fb1e8.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.312fb1e8.js.map"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "c0f4d970f2ac4c78957d12e67fb11b4e" -> "c8912435231078e9623ca420d105370c"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "1BpaQIM6ZNCpknEysx1uZHnuiFPuO95H" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "a8271052c586bff7e217ec7707ba8a48" -> "6bcc44871d76449c0d6c623e33b479de"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "jhrYj60ECfQaLXhWxM7uNlPbOIjgr9sa" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.312fb1e8.js"] will be destroyed
  # (because key ["static/js/main.312fb1e8.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "f3d06891ff78aac3b2cdca000efcf5b5" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.312fb1e8.js" -> null
      - key                    = "static/js/main.312fb1e8.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.312fb1e8.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "4yuTo6_cdWeqFfvrP9nnmFsfeOQFAiJ8" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.312fb1e8.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.312fb1e8.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "63c7e8c8c109e59cec81dd0832390f86" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.312fb1e8.js.LICENSE.txt" -> null
      - key                    = "static/js/main.312fb1e8.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.312fb1e8.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "sLxOi1WXpp38cm.cqUPk6.ANT81TrUKh" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.312fb1e8.js.map"] will be destroyed
  # (because key ["static/js/main.312fb1e8.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "0843c7bd081bf8c8933c81808452cff4" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.312fb1e8.js.map" -> null
      - key                    = "static/js/main.312fb1e8.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.312fb1e8.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "q1K0drWS3vMNrJBdwM7x80D5Vk3LMCvk" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.79e18965.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "161d915f18d2035d8de105a6b1e5d53b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.79e18965.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.79e18965.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.79e18965.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "63c7e8c8c109e59cec81dd0832390f86"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.79e18965.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.79e18965.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.79e18965.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "5cef6fb730369b1e3a0113d5e75dbdf9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.79e18965.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.79e18965.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*